#include <iostream>

using namespace std;

int main() {

    // 문자열: 문자의 열, 문자의 집합.

    // char형으로 배열의 사이즈를 5로하여 'H', 'e', 'l', 'l', 'o' 원소를 넣어 초기화 해준뒤 배열을 출력해보면 콘솔에 'Hello'문자외의 이상한 문자가 뒤에 함께 출력되는 것을 볼 수 있습니다.
    // 뒤에 이상한 문자가 뒤에 함께 출력되는 이유는 바로 null 문자 때문입니다.
    // 때문에 정상적인 'Hello'를 출력하기 위해서는 배열의 사이즈를 6으로 늘리고 배열의 맨 마지막 index에 null('\0')을 넣어주면 됩니다.
    char a[6] = { 'H', 'e', 'l', 'l', 'o', '\0'};
    cout << a << endl; 

    // 위와 같이 char형으로 배열로 만들어 문자열을 선언하는 것 보다 더 효율적인 방법은 배열의 특성을 이용하는 것이 더 효율적입니다.
    // 배열의 특성 중 하나인 배열의 사이즈를 빈 값으로 놔 둘 경우, 컴파일러가 알아서 배열 내부 요소의 값의 크기를 알아내어 그 사이즈에 딱 맞게 한다는 것을 이용하면 됩니다.
    // 예를 들어 char a[] ={ 'a', 'b' }; 일 경우에는 2개의 char 형이 들어가 있으므로 컴파일러는 알아서 배열이 2의 사이즈를 같도록 합니다.
    // 그렇다면 "" 이 쌍따옴표와 배열의 특성을 조합하면 더 효율적일 것 입니다.
    // 쌍따옴표 내부에는 보이지는 않지만 null(\0)이 포함되어 있습니다.
    // 예를 들어 "A"의 경우 실제로는 "A\0"인 것입니다.
    // 따라서 문자열을 만들때 다음과 같이 만들면 효율적입니다.
    char b[] = "Hello2";

    cout << b << endl;

    return 0;
}