#include <iostream>

using namespace std;

int main() {
    /*
    C++는 복합데이터형을 제공합니다.
    >> 사용자 정의대로 새로운 데이터형을 만들 수 있습니다.
    복합데이터형 : 기본 정수형과 부동소수점형의 조합.
    */

   // char 형 역시 근본적으로는 정수로 저장된다.

   /*
   배열(array): 같은 데이터형의 집합
   선언 형식 => typeName arrayName[arraySize];
   */

  // 예: short 데이터 형의 month라는 이름을 가진 사이즈가 12인 배열 선언.
  short month[12];

  // 예: short 데이터 형의 day라는 이름을 가진 사이즈가 31인 배열을 요소 1,2,3을 넣어 초기화.
  short day[31] = { 1, 2, 3};

  // 배열의 요소 접근 index를 통해 접근 => arrayName[index]

  // 예: day 배열의 0번째 index에 접근하여 1 출력.

  /*
  배열 원소에 대입할 값들을 콤마로 구분하여 중괄호로 묶어 선언합니다.
  초기화를 선언 이후 나중에 할 수는 없습니다.
  배열을 다른 배열에 통째로 대입할 수 없습니다.
  초기화 값의 개수를 배열 원소의 개수보다 모자라게 제공할 수 있습니다.
  배열을 부분적으로 초기화하면, 나머지 원소들은 모두 0으로 설정합니다.
  즉, 명시적으로 첫 번째 원소만 0으로 초기화하면, 나머지 원소들은 모두 0으로 초기화됩니다.
  배열을 초기화할 때 대괄호 속을 비워두면 컴파일러가 초기화 값의 개수를 헤아려 배열 원소 개수를 저장합니다.
  */
  cout << "day 배열의 0번째 index 요소 : " << day[0] << endl;
  cout << "day 배열의 1번째 index 요소 : " << day[1] << endl;



    return 0;
}